{
  "Neck and Shoulders": {
    "description": [
      "A01 - Lateral Neck Stretch:  Look  forward  while  keeping  your  head  up.  Slowly move your ear towards your shoulder while keeping your hands behind your back.",
      "A02 - Rotating Neck Stretch:  Stand  upright  while  keeping  your  shoulders  still and your head up, then slowly rotate your chin towards your shoulder.",
      "A03 - Forward Flexion Neck Stretch: Stand upright and let your chin fall forward towards your chest. Relax your shoulders and keep your hands by your side.",
      "A04 - Diagonal Flexion Neck Stretch: Stand upright and let your chin fall forward towards your chest. Then gently lean your head to one side.",
      "A05 - Neck Extension Stretch: Stand upright and lift your head, looking upwards as if trying to point up with your chin. Relax your shoulders and keep your hands by your side.",
      "A06 -  Neck Protraction  Stretch:  While  looking  straight  ahead,  push  your  head forward by sticking your chin out.",
      "A07 - Sitting Neck Flexion Stretch: While sitting on a chair, cross your arms and hold onto  the  chair between your legs. Let your head fall forward and then lean backwards.",
      "A08 - Parallel Arm Shoulder Stretch: Stand upright and place one arm across your body.  Keep  your  arm  parallel  to  the  ground  and  pull  your  elbow  towards your body.",
      "A09 - Bent Arm Shoulder Stretch:  Stand  upright  and  place  one  arm  across  your body. Bend your arm at 90 degrees and pull your elbow towards your body.",
      "A10 - Wrap-around Shoulder Stretch: Stand  upright  and wrap your  arms  around your shoulders as if hugging yourself. Pull your shoulders back.",
      "A11 - Cross-over Shoulder Stretch: Stand with your knees bent. Cross your arms over  and  grab  the  back  of  your  knees,  then start  to  rise  upwards  until  you feel tension in your upper back and shoulders.",
      "A12 - Reaching-up Shoulder Stretch: Place  one  hand  behind  your  back  and  then reach up between your shoulder blades.",
      "A13 - Elbow-out Rotator Stretch: Stand with your hand behind the middle of your back  and  your  elbow  pointing  out.  Reach  over  with  your  other  hand  and gently pull your elbow forward.",
      "A14  -  Arm-up  Rotator  Stretch:  Stand  with  your  arm  out  and  your  forearm pointing  upwards  at  90  degrees.  Place  a  broom  stick  in  your  hand  and behind your elbow. With your other hand pull the bottom of the broom stick forward.",
      "A15  -  Arm-down  Rotator  Stretch:  Stand  with  your  arm  out  and  your  forearm pointing  downwards  at  90  degrees.  Place  a  broom  stick  in  your  hand  and behind  your  elbow.  With  your  other  hand  pull  the  top  of  the  broom  stick forward.",
      "A16 - Reverse Shoulder Stretch:  Stand  upright  and  clasp  your  hands  together behind  your  back.  Keep  your  arms  straight  and  slowly  lift  your  hands upward.",
      "A17 - Assisted Reverse Shoulder Stretch: Stand upright with your back towards a table or bench and place your hands on the edge of the table or bench. Keep\nyour arms straight and slowly lower your entire body."
    ],
    "muscles": [
      "deltoid anterior, medius, posterior",
      "infraspinatus",
      "levator scapulae",
      "longissimus capitis",
      "longissimus cervicis",
      "omohyoid",
      "platysma",
      "scalenus anterior, medius, posterior",
      "semispinalis capitis",
      "semispinalis cervicis",
      "serratus anterior"
    ],
    "sports": []
  },
  "Arms and Chest": {
    "description": [
      "B01 - Above Head Chest Stretch: Stand upright and interlock your fingers. Bend your  arms  and  place  them  above  your  head  while  forcing  your  elbows  and hands backwards.",
      "B02 - Partner Assisted Chest Stretch: Extend both arms parallel to the ground and have   a   partner   hold   on   to   your   hands,   then   slowly   pull   your   arms backwards.",
      "B03 - Seated Partner Assisted Chest Stretch: Sit on the ground and have a partner stand  behind  you.  Reach  behind  with  both  arms  and  have  the  partner further extend your arms.",
      "B04 - Parallel Arm Chest Stretch: Stand with your arm extended to the rear and parallel  to  the  ground. Hold on to  an immovable  object and then turn your shoulders and body away from your outstretched arm.",
      "B05 - Bent Arm Chest Stretch: Stand with your arm extended and your forearm pointing  up  at  90  degrees.  Rest  your  forearm  against  an  immovable  object and then turn your shoulders and body away from your extended arm.",
      "B06 - Assisted Reverse Chest Stretch:  Stand  upright  with  your  back  towards  a table or bench and place your hands on the edge of the table or bench. Bend your arms and slowly lower your entire body.",
      "B07 - Bent-over Chest Stretch: Face a wall and place both hands on the wall just above   your   head.   Slowly   lower   your   shoulders   as   if   moving   your   chin towards the ground.",
      "B08 - Kneeling Chest Stretch: Kneel on the floor in front of a chair or table and interlock your forearms above your head. Place your arms on the object and lower your upper body toward the ground.",
      "B09 - Reaching-down Triceps Stretch:  Reach  behind  your  head  with  both  hands and  your  elbows  pointing  upwards.  Then  reach  down  your  back  with  your hands.",
      "B10 - Assisted Triceps Stretch: Stand with one hand behind your neck and your elbow  pointing  upwards.  Then  use  your  other  hand  (or  a  rope  or  towel)  to pull your elbow down.",
      "B11  -  Kneeling  Forearm  Stretch:  While   crouching  on   your  knees   with   your forearms   facing   forward   and   hands   pointing   backwards,   slowly   move rearward.",
      "B12 - Palms-out Forearm Stretch:  Interlock  your  fingers  in  front  of  your  chest, then  straighten  your  arms  and  turn  the  palms  of  your  hands  so  that  they face outwards.",
      "B13 - Fingers-down Forearm Stretch: Hold onto your fingers and turn your palms outwards.  Straighten  your  arm  and  then  pull  your  fingers  back  using  your other hand.",
      "B14  -  Finger  Stretch:  Place  the  tips  of  your  fingers  together  and  push  your palms towards each other.",
      "B15 - Thumb Stretch: Start with your fingers pointing up and your thumb out to one side, then use your other hand to pull your thumb down.",
      "B16 - Fingers-down Wrist Stretch:  Hold  on  to  your  fingers  and  straighten  your arm, then pull your fingers towards your body.",
      "B17 - Rotating Wrist Stretch: Place one arm straight out in front and parallel to the  ground. Rotate  your wrist down and outwards and then use  your other\nhand to further rotate your hand upwards."
    ],
    "muscles": [
      "biceps brachii",
      "brachialis",
      "brachioradialis",
      "coracobrachialis",
      "extensor carpi radialis longus and brevis",
      "extensor carpi ulnaris",
      "extensor digiti minimi",
      "extensor digitorum",
      "extensor indicis",
      "extensor pollicis longus and brevis",
      "flexor carpi radialis",
      "flexor carpi ulnaris",
      "flexor digitorum profundus",
      "flexor digitorum superficialis",
      "flexor pollicus brevis",
      "flexor pollicis longus",
      "opponens digiti minimi",
      "opponens pollicis",
      "palmer interossei",
      "palmaris longus",
      "pectoralis major",
      "pectorilis minor",
      "pronator teres",
      "supinator",
      "triceps"
    ],
    "sports": [
      "basketball",
      "netball",
      "batting  sports",
      "cricket",
      "baseball",
      "softball",
      "hiking",
      "backpacking",
      "mountaineering",
      "orienteering",
      "ice  hockey",
      "field  hockey",
      "martial  arts",
      "racquet  sports",
      "tennis",
      "badminton",
      "squash",
      "rowing",
      "canoeing",
      "kayaking",
      "swimming",
      "throwing  sports",
      "cricket",
      "baseball",
      "field events",
      "volleyball",
      "wrestling"
    ]
  },
  "Stomach": {
    "description": [
      "C01 - On Elbows Stomach Stretch: Lie  face  down  and  bring  your  hands  close  to your shoulders. Keep your hips on the ground, look forward and rise up onto your elbows.",
      "C02 - Rising Stomach Stretch: Lie face down and bring your hands close to your shoulders.  Keep  your  hips  on  the  ground,  look  forward  and  rise  up  by straightening your arms.",
      "C03 - Rotating Stomach Stretch: Lie face down and bring your hands close to your shoulders.  Keep  your  hips  on  the  ground,  look  forward  and  rise  up  by straightening your arms. Then slowly bend one arm and rotate that shoulder towards the ground.",
      "C04 - Standing Lean-back Stomach Stretch: Stand upright with your feet shoulder width   apart  and  place   your  hands  on   your  buttocks  for  support.   Look upwards and slowly lean backwards at the waist.",
      "C05  -  Standing  Lean-back  Side  Stomach  Stretch:  Stand  upright  with  your  feet shoulder  width  apart  and  place  one  hand  of  your  buttocks.  Look  up  and slowly lean backwards at the waist, then reach over with your opposite hand and rotate at the waist.",
      "C06 - Back Arching Stomach Stretch: Sit on a Swiss ball and slowly roll  the ball forward  while  leaning  back.  Allow  your  back  and  shoulders  to  rest  on  the ball and your arms to hang to each side."
    ],
    "muscles": [
      "obliques external and internal",
      "transversus abdominis",
      "rectus abdominis"
    ],
    "sports": [
      "batting  sports",
      "cricket",
      "baseball",
      "softball",
      "boxing",
      "contact sports",
      "football",
      "gridiron",
      "rugby",
      "golf",
      "hiking",
      "backpacking",
      "mountaineering",
      "orienteering",
      "ice   hockey",
      "field   hockey",
      "ice skating",
      "roller skating",
      "inline skating",
      "martial arts",
      "rowing",
      "canoeing",
      "kayaking",
      "running",
      "track",
      "cross  country",
      "running  sports",
      "football",
      "soccer",
      "gridiron",
      "rugby",
      "snow   skiing",
      "water   skiing",
      "surfing",
      "walking",
      "race walking",
      "wrestling"
    ]
  },
  "Back and Sides": {
    "description": [
      "D01 - Reach Forward Upper Back Stretch: Stand with your arms out in front and your  hands  crossed  over,  then  push  your  hands  forward  as  far  as  possible and let your head fall forward.",
      "D02 - Reaching Upper Back Stretch: Sit in a squatting position while facing a door edge   or   pole,   then   hold   onto   the   door   edge   with   one   hand   and   lean backwards away from the door.",
      "D03 - Reach-up Back Stretch: Stand with your arms crossed over and then raise them  above  your head. Let your  head fall  forward and reach up  as high  as you can.",
      "D04 - Lying Whole Body Stretch: Lie on your back and extend your arms behind you.  Keep  your  toes  pointing  upwards  and  lengthen  your  body  as  much  as you can.",
      "D05 - Sitting Bent-over Back Stretch: Sit on the ground with your legs straight out in  front  or  at  45  degrees  apart.  Keep  your  toes  pointing  upwards  and  rest your  arms  by  your  side  or  on  your  lap.  Relax  your  back  and  neck  and  let your head and chest fall forward.",
      "D06 - Sitting Side Reach Stretch: Sit with one leg straight out to the side and your toes  pointing  upwards.  Then  bring  your  other  foot  up  to  your  knee  and  let your  head  fall  forward.  Reach  towards  the  outside  of  your  toes  with  both hands.",
      "D07 - Standing Knee-to-chest Stretch: While standing, use your hands to bring one knee into your chest.",
      "D08 - Lying Knee-to-chest Stretch: Lie on your back and keep one leg flat on the ground. Use your hands to bring your other knee into your chest.",
      "D09 - Lying Double Knee-to-chest Stretch: Lie on your back and use your hands to bring both knees into your chest.",
      "D10 - Kneeling Reach Forward Stretch:  Kneel  on  the  ground  and  reach  forward with  your  hands.  Let  your  head  fall  forward  and  push  your  buttocks  back towards your feet.",
      "D11 - Kneeling Back-arch Stretch: Kneel on your hands and knees. Let your head fall forward and arch your back upwards.",
      "D12 - Kneeling Back-slump Stretch: Kneel on your hands and knees. Look up and let your back slump downwards.",
      "D13  -  Kneeling  Back  Rotation  Stretch:  Kneel  on  the  ground  and  raise  one  arm upwards while rotating your shoulders and middle back.",
      "D14 - Standing Back Rotation Stretch: Stand with your feet shoulder width apart. Place  your hands across  your  chest  while  keeping  your  back  and  shoulders upright. Slowly rotate your shoulders to one side.",
      "D15  -  Standing  Reach-up  Back  Rotation  Stretch:  Stand  with  your  feet  shoulder width apart. Place your hands above your head while keeping your back and shoulders upright. Slowly rotate your back and shoulders to one side.",
      "D16 - Lying Leg Cross-over Stretch: Lie  on your back and cross one leg over the other. Keep your arms out to the side and both legs straight. Let your back and hips rotate with your leg.",
      "D17 - Lying Knee Roll-over Stretch:  While  lying  on  your  back,  bend  your  knees and  let  them  fall  to  one  side.  Keep  your  arms  out  to  the  side  and  let  your back and hips rotate with your knees.",
      "D18 - Sitting Knee-up Rotation Stretch: Sit with one leg straight and the other leg crossed  over  your  knee.  Turn  your  shoulders  and  put  your  arm  onto  your raised knee to help rotate your shoulders and back.",
      "D19 - Sitting knee-up Extended Rotation Stretch: Sit with one leg crossed under the other  and  the  other  foot  crossed  over  your  knee,  then  turn  your  shoulders and  put  your  arm  onto  your  raised  knee  to  help  rotate  your  shoulders  and back.",
      "D20 - Kneeling Reach-around Stretch:  Kneel  on  your  hands  and  knees  and  then take  one  hand  and  reach  around  towards  your  ankle.  Keep  your  back parallel to the ground.",
      "D21 - Standing Lateral Side Stretch:  Stand  with  your  feet  about  shoulder  width apart and look forward. Keep your body upright and slowly bend to the left or right. Reach down your leg with your hand and do not bend forward.",
      "D22 - Reaching Lateral Side Stretch: Stand  with  your  feet  shoulder  width  apart, then slowly bend to the  side and reach over the top of your head with your hand. Do not bend forward.",
      "D23 - Sitting Lateral Side Stretch: Sit on a chair with your feet flat on the ground, then slowly bend to the left or right while reaching towards the ground. Do\nnot bend forward."
    ],
    "muscles": [
      "iliocostalis cervicis",
      "iliocostalis thoracis",
      "iliocostalis lumborum",
      "intercostals external and internal",
      "interspinales",
      "intertransversarii",
      "latissimus dorsi",
      "longissimus thoracis",
      "multifidus",
      "quadratus lumborum",
      "rhomboids",
      "rotatores",
      "semispinalis thoracis",
      "spinalis thoracis"
    ],
    "sports": [
      "basketball",
      "netball",
      "batting  sports",
      "cricket",
      "baseball",
      "softball",
      "boxing",
      "contact  sports",
      "football",
      "rugby",
      "gridiron",
      "cycling",
      "golf",
      "hiking",
      "backpacking",
      "mountaineering",
      "orienteering",
      "ice  hockey",
      "field hockey",
      "ice skating",
      "roller skating",
      "inline skating",
      "martial arts",
      "racquet  sports",
      "tennis",
      "badminton",
      "squash",
      "rowing",
      "canoeing",
      "kayaking",
      "running",
      "track",
      "cross country",
      "running sports",
      "football",
      "soccer",
      "gridiron",
      "rugby",
      "snow   skiing",
      "water   skiing",
      "surfing",
      "swimming",
      "throwing   sports",
      "cricket",
      "baseball",
      "field   events",
      "volleyball",
      "walking",
      "race walking",
      "wrestling"
    ]
  },
  "Hips and Buttocks": {
    "description": [
      "E01 - Lying Cross-over Knee Pull-down Stretch: Lie on your back and cross one leg over  the  other.  Bring  your  foot  up  to  your  opposite  knee  and  with  your opposite arm pull your raised knee down towards the ground.",
      "E02 - Lying Leg Tuck Hip Stretch:  Lie  face  down  and  bend  one  leg  under  your stomach. Lean towards the ground.",
      "E03 - Standing Leg Tuck Hip Stretch: Stand beside a chair or table and place the foot  furthest  from  the  object  onto  the  object.  Relax  your  leg,  lean  forward and bend your other leg, lowering yourself towards the ground.",
      "E04 - Standing Leg Resting Hip Stretch: Stand beside a chair or table for balance, bend one leg and place your other ankle on to your bent knee. Slowly lower yourself towards the ground.",
      "E05 - Sitting Rotational Hip Stretch: Sit  with  one  leg  crossed  and  your  other  leg behind  your  buttocks  then  lean  your  whole  body  towards  the  leg  that  is behind your buttocks.",
      "E06 - Standing Rotational Hip Stretch: Stand  beside  a  table  and  raise  your  lower leg out to the side and up onto the table. Then slowly lower your body.",
      "E07 - Sitting  Cross-legged  Reach  Forward  Stretch:  Sit  with  you  legs  crossed  and your knees out, then gently reach forward.",
      "E08 - Sitting Feet-together Reach Forward Stretch:  Sit  with  the  soles  of  your  feet together and your knees out, then gently reach forward.",
      "E09 - Sitting Knee-to-chest Buttocks Stretch: Sit with one leg straight and the other leg  crossed  over  your  knee.  Pull  the  raised  knee  towards  your  opposite shoulder   while   keeping   your   back   straight   and   your   shoulders   facing forward.",
      "E10 - Sitting Foot-to-chest Buttocks Stretch:  Sit  with  one  leg  straight,  hold  onto your other ankle and then pull it directly towards your chest.",
      "E11 - Lying Cross-over Knee Pull-up Stretch:  Lie  on  your  back  and  cross  one  leg over  the  other.  Bring  your  foot  up  to  your  opposite  knee  and  with  your opposite arm pull your raised knee up towards your chest.",
      "E12 - Sitting Leg Resting Buttocks Stretch:  Sit  with  one  leg  slightly  bent.  Raise your other foot up onto your raised leg and rest it on your thigh, then slowly reach forward.",
      "E13 - Lying Leg Resting Buttocks Stretch: Lie on your back and slightly bend one leg.  Raise  your  other  foot  up  onto  your  bent  leg  and  rest  it  on  your  thigh.\nThen reach forward, holding onto your knee and pull towards you."
    ],
    "muscles": [
      "gemellus superior and inferior",
      "gluteus maximus",
      "iliacus",
      "obturator internus and externus",
      "piriformis",
      "psoas major",
      "psoas minor",
      "quadratus femoris"
    ],
    "sports": []
  },
  "Quadriceps": {
    "description": [
      "F01 - Kneeling Quad Stretch:  Kneel  on  one  foot  and  the  other  knee.  If  needed, hold on to something to keep your balance and then push your hips forward.",
      "F02 - Standing Quad Stretch: Stand upright while balancing on one leg. Pull your other  foot  up  behind  your  buttocks  and  keep  your  knees  together  while pushing your hips forward. Hold on to something for balance if needed.",
      "F03 - Standing  Reach-up  Quad  Stretch:  Stand  upright  and  take  one  small  step forward. Reach up with both hands, push your hips forward, lean back and then lean away from your back leg.",
      "F04 - Lying Quad Stretch: Lie face down, reach back with one hand and pull one foot up behind your buttocks.",
      "F05 - Lying Side Quad Stretch: Lie on your side and pull your top leg behind your buttocks. Keep your knees together and push your hips forward.",
      "F06 - Single Lean-back Quad Stretch: Sit on the ground, bend one knee and place that foot next to your buttocks. Then slowly lean backwards.",
      "F07 - Double Lean-back Quad Stretch:  Sit  on  the  ground,  bend  both  knees  and place your feet next to your buttocks. Then slowly lean backwards."
    ],
    "muscles": [],
    "sports": []
  },
  "Hamstrings": {
    "description": [
      "G01 - Sitting Reach-forward Hamstring Stretch:  Sit  with  both  legs  straight  out  in front, or at 45 degrees apart. Keep your toes pointing straight up, make sure your back is straight and then reach forward.",
      "G02 - Standing  Toe-down Hamstring  Stretch:  Stand  with  one  knee  bent  and  the other leg straight out in front. Point your toes towards the ground and lean forward. Keep your back straight and rest your hands on your bent knee.",
      "G03 - Standing Toe-up Hamstring Stretch: Stand with one knee bent and the other leg  straight  out  in  front.  Point  your  toes  upwards  and  lean  forward.  Keep your back straight and rest your hands on your bent knee.",
      "G04 - Standing Leg-up Hamstring Stretch: Stand upright and raise one leg on to an object. Keep that leg straight and  point your toes upwards. Keep your back straight and lean your upper body forward.",
      "G05 - Standing Leg-up Toe-in Hamstring Stretch: Stand upright and raise one leg on to an object. Keep that leg straight and point your toes upwards. Then point the toes of your other foot inward and lean forward while keeping your back straight.",
      "G06 - Sitting Single Leg Hamstring Stretch: Sit  with  one  leg  straight  out  in  front and  point  your  toes  upwards.  Bring  your  other  foot  towards  your  knee  and reach towards your toes with both hands.",
      "G07 - Lying Partner Assisted Hamstring Stretch:  Lie  on  your  back  and  keep  both legs straight. Have a partner raise one of your legs off the ground and as far back as is comfortable. Make sure your toes are pointing directly backwards.",
      "G08  -  Lying  Bent  Knee  Hamstring  Stretch:  Lie  on  your  back  and  bend  one  leg slightly. Pull the other knee towards your chest and  then slowly straighten your raised leg.",
      "G09 - Lying Straight Knee Hamstring Stretch: Lie on your back and  keep your legs straight. Raise one leg and pull it towards your chest.",
      "G10 - Kneeling Toe-up Hamstring Stretch: Kneel on one knee and place your other leg straight forward with your heel on the ground. Keep your back straight and  point  your  toes  upwards.  Reach  towards  your  toes  with  one  or  both hand.",
      "G11 - Sitting Leg Resting Hamstring Stretch: Sit with one leg straight out in front and your toes pointing upwards. Cross your other leg over and rest your foot on  your  thigh.  Lean  forward,  keep  your  back  straight  and  reach  for  your toes.",
      "G12 - Standing Leg-up Bent Knee Hamstring Stretch: Stand with one foot raised onto a  chair  or  an  object.  Bend  your  knee  and  let  your  heel  drop  off  the  edge  of the object. Keep your back straight and move your chest towards your raised knee.",
      "G13 - Standing High-leg Bent Knee Hamstring Stretch:  Stand  with  one  foot  raised onto a table. Keep your leg bent and lean your chest into your bent knee.",
      "G14 - Sitting  Bent Knee Toe-pull Hamstring  Stretch:  Sit  on  the  ground  with  your knees slightly bent. Hold onto your toes with your hands and pull your toes towards your body. Keep your back straight and lean forward.",
      "G15 - Standing Reach-down Hamstring Stretch: Stand with your feet shoulder width apart. Bend forward and reach towards the ground."
    ],
    "muscles": [
      "biceps femoris",
      "semimembranosus",
      "semitendinosis"
    ],
    "sports": [
      "cycling",
      "hiking",
      "backpacking",
      "mountaineering",
      "orienteering",
      "ice   hockey",
      "field   hockey",
      "ice   skating",
      "roller   skating",
      "inline skating",
      "martial  arts",
      "running",
      "track",
      "cross  country",
      "running  sports",
      "football",
      "soccer",
      "gridiron",
      "rugby",
      "snow  skiing",
      "water  skiing",
      "surfing",
      "walking",
      "race walking",
      "wrestling"
    ]
  },
  "Adductors": {
    "description": [
      "H01 - Sitting Feet-together Adductor Stretch: Sit with the soles of your feet together and bring your feet towards your groin. Hold onto your ankles and push your knees toward the ground with your elbows. Keep your back straight.",
      "H02 - Standing Wide Knees Adductor Stretch: Stand with your feet wide apart and your toes pointing diagonally outwards, then bend your knees, lean forward and use your hands to push your knees outwards.",
      "H03 - Standing Leg-up Adductor Stretch:  Stand  upright  and  place  one  leg  out  to the  side  and your foot up on a raised object. Keep your toes facing forward and slowly move your other leg away from the object.",
      "H04 - Kneeling Leg-out Adductor Stretch: Kneel on one knee and place your other leg out to the side with your toes  pointing forward. Rest your hands on the ground and slowly move your foot further out to the side.",
      "H05 - Squatting Leg-out Adductor Stretch: Stand with  your feet wide  apart. Keep one leg straight and your toes pointing forward while bending the other leg and turning your toes out to the side. Lower your groin towards the ground and rest your hands on your bent knee or the ground.",
      "H06 - Kneeling Face-down Adductor Stretch: Kneel face down with your knees and toes facing out. Lean forward and let your knees move outwards.",
      "H07 - Sitting Wide-leg Adductor Stretch: Sit on the ground with your legs straight out and as wide apart as possible and then reach forward while keeping your back straight.",
      "H08 - Standing Wide-leg Adductor Stretch: Start  by  standing  with  your  feet  wide apart and your toes pointing forward. Then lean forward and reach towards the ground."
    ],
    "muscles": [
      "adductor brevis",
      "adductor longus",
      "adductor magnus",
      "pectineus",
      "gracilis"
    ],
    "sports": [
      "cycling",
      "hiking",
      "backpacking",
      "mountaineering",
      "orienteering",
      "ice   hockey",
      "field   hockey",
      "ice   skating",
      "roller   skating",
      "inline skating",
      "martial  arts",
      "running",
      "track",
      "cross  country",
      "running  sports",
      "football",
      "soccer",
      "gridiron",
      "rugby",
      "snow  skiing",
      "water  skiing",
      "surfing",
      "walking",
      "race walking",
      "wrestling"
    ]
  },
  "Abductors": {
    "description": [
      "I01 - Standing Hip-out Abductor Stretch: Stand upright beside a chair or table with both  feet  together.  Lean  your  upper  body  towards  the  chair  while  pushing your hips away from the chair. Keep your outside leg straight and bend your inside leg slightly.",
      "I02 - Standing Leg-cross Abductor Stretch: Stand upright and cross one foot behind the other. Lean towards the foot that is behind the other.",
      "I03 - Leaning Abductor Stretch: While standing next to a pole, or door jam, hold onto  the  pole  with  one  hand.  Keep  your  feet  together,  and  lean  your  hips away from the pole. Keep your outside leg straight and bend your inside leg slightly.",
      "I04 - Standing Leg-under Abductor Stretch: While standing lean forward and hold onto a chair or bench to  help with balance. Cross one  foot behind the other and slide that foot to the side. Keep your leg straight and slowly bend your front leg to lower your body.",
      "I05 - Lying Abductor Stretch: Lean on your side on the ground and bring your top leg up to your other knee. Push your body up with your arm and keep your hip on the ground.",
      "I06 - Lying Swiss-ball Abductor Stretch:  Lean  on  your  side  on  a  Swiss  ball  and place  one  leg  straight  out  to  the  side.  Bring  your  top  leg  up  to  your  other knee and push your hip towards the ground.",
      "I07 - Lying Leg-hang Abductor Stretch: Lie on your side on a bench, let your top leg fall forward and off the side of the bench."
    ],
    "muscles": [
      "gluteus medius",
      "gluteus mininus",
      "tensor fasciae latae"
    ],
    "sports": [
      "hiking",
      "backpacking",
      "mountaineering",
      "orienteering",
      "ice   hockey",
      "field hockey",
      "ice   skating",
      "roller   skating",
      "inline   skating",
      "martial   arts",
      "rowing",
      "canoeing",
      "kayaking",
      "running",
      "track",
      "cross   country",
      "running sports",
      "football",
      "soccer",
      "gridiron",
      "rugby",
      "snow skiing",
      "water skiing",
      "walking",
      "race walking"
    ]
  },
  "Upper Calves": {
    "description": [
      "J01 - Standing Toe-up Calf Stretch: Stand upright and place  the ball of your foot on a step or raised object. Keep your leg straight and lean towards your toes.",
      "J02 - Standing Toe Raised Calf Stretch: Stand with one knee bent and the other leg straight out in front. Point your toes  upwards  and lean forward. Keep your back straight and rest your hands on your bent knee.",
      "J03 - Single Heel-drop Calf Stretch: Stand on a raised object or step. Put the  ball of one foot on the edge of the step and keep your leg straight. Let your heel drop towards the ground.",
      "J04 - Double Heel-drop Calf Stretch: Stand on a raised object or step. Put the balls of  both  feet  on  the  edge  of  the  step  and  keep  your  legs  straight.  Let  your heels drop towards the ground.",
      "J05  -  Standing  Heel-back  Calf  Stretch:  Stand  upright  and  take  one  big  step backwards.  Keep  your  back  leg  straight,  your  toes  pointing  forward  and push your heel to the ground.",
      "J06 - Leaning Heel-back Calf Stretch: Reach towards a wall and place one foot as far  from  the  wall  as  is  comfortable.  Make  sure  that  both  toes  are  pointing forward  and  your  heel  is  on  the  ground.  Keep  your  back  leg  straight  and lean towards the wall.",
      "J07 - Crouching Heel-back Calf Stretch: Stand upright and place one foot in front of the other. Bend your front leg and keep your back leg straight. Push your heel  to  the  ground  and  lean  forward.  Place  your  hands  on  the  ground  in front of you.",
      "J08 - Sitting Toe-pull Calf Stretch: Sit with one leg straight out in front and your toes pointing upwards. Reach forward and pull your toes back towards your body."
    ],
    "muscles": [
      "gastrocnemius",
      "plantaris"
    ],
    "sports": [
      "boxing",
      "cycling",
      "hiking",
      "backpacking",
      "mountaineering",
      "orienteering",
      "ice  hockey",
      "field hockey",
      "ice  skating",
      "roller  skating",
      "inline  skating",
      "martial  arts",
      "racquet  sports",
      "tennis",
      "badminton",
      "squash",
      "running",
      "track",
      "cross  country",
      "running  sports",
      "football",
      "soccer",
      "gridiron",
      "rugby",
      "snow   skiing",
      "water   skiing",
      "surfing",
      "swimming",
      "walking",
      "race walking"
    ]
  },
  "Lower Calves and Achilles": {
    "description": [
      "K01 - Standing Toe-up Achilles Stretch: Stand  upright  and  place  the  ball  of  your foot onto a step or raised object. Bend your knee and lean forward.",
      "K02 - Single Heel-drop Achilles Stretch: Stand on a raised object or step and place the ball of one of your feet on the edge of the step. Bend your  knee slightly and let your heel drop towards the ground.",
      "K03  -  Standing  Heel-back  Achilles  Stretch:  Stand  upright  and  take   one   step backwards. Bend your back knee and push your heel towards the ground.",
      "K04 - Leaning Heel-back Achilles Stretch: Reach towards a wall and place one foot as far from the wall as is comfortable. Make sure that both toes are pointing forward  and  your  heels  are  on  the  ground.  Bend  your  back  knee  and  lean towards the wall.",
      "K05 - Sitting Toe-pull Achilles Stretch: Sit on the ground with your knees slightly bent. Hold onto  your toes with your hands and pull  your toes towards your body.",
      "K06 - Crouching Heel-back Achilles Stretch:  Stand  upright  and  place  one  foot  in front of the other. Bend your front leg and your back leg and then push your back  heel  towards  the  ground.  Lean  forward  and  place  your  hands  on  the ground in front of you.",
      "K07 - Kneeling Heel-down Achilles Stretch: Kneel on one foot and place your body weight over your knee. Keep your heel on the ground and lean forward.",
      "K08 - Squatting Achilles Stretch: Stand with your feet shoulder width apart. Then bend your legs and lower your body into a sitting position. Place your hands out in front for balance."
    ],
    "muscles": [
      "flexor digitorum longus",
      "flexor hallucis longus",
      "peroneus longus and brevis",
      "soleus",
      "tibialis posterior"
    ],
    "sports": [
      "boxing",
      "cycling",
      "hiking",
      "backpacking",
      "mountaineering",
      "orienteering",
      "ice  hockey",
      "field hockey",
      "ice  skating",
      "roller  skating",
      "inline  skating",
      "martial  arts",
      "racquet  sports",
      "tennis",
      "badminton",
      "squash",
      "running",
      "track",
      "cross  country",
      "running  sports",
      "football",
      "soccer",
      "gridiron",
      "rugby",
      "snow   skiing",
      "water   skiing",
      "surfing",
      "swimming",
      "walking",
      "race walking"
    ]
  },
  "Shins, Ankles, Feet and Toes": {
    "description": [
      "L01 - Foot-behind Shin Stretch: Stand upright and place  the  top of your toes on the ground behind you. Push your ankle to the ground.",
      "L02 - Front Cross-over Shin Stretch: Stand upright and place the top of your toes on  the  ground  in  front  of  your  other  foot.  Slowly  bend  your  other  knee  to force your ankle to the ground.",
      "L03 - Raised Foot Shin Stretch: Stand with your back to a chair. Place the top of your toes onto the chair and then push your ankle downwards.",
      "L04  -  Double  Kneeling  Shin  Stretch:  Sit  with  your  knees  and  feet  flat  on  the ground.  Sit  back  on  your  ankles  and  keep  your  knees  together.  Place  your hands  next  to  your  knees  and  slowly  lean  backwards  while  raising  your knees off the ground.",
      "L05 - Squatting Toe Stretch: Kneel  on  one  foot  with  your  hands  on  the  ground. Keep the toes of your rear foot on the ground, slowly lean forward and arch your foot.",
      "L06 - Ankle Rotation Stretch: Raise one foot off the ground and slowly rotate your foot and ankle in all directions."
    ],
    "muscles": [
      "abductor digiti minimi",
      "abductor hallucis",
      "adductor hallucis",
      "extensor digitorum longus",
      "extensor hallucis longus",
      "flexor digiti minimi brevis",
      "quadratus plantae",
      "tibialis anterior"
    ],
    "sports": [
      "boxing",
      "cycling",
      "hiking",
      "backpacking",
      "mountaineering",
      "orienteering",
      "ice hockey",
      "field hockey",
      "ice skating",
      "roller skating",
      "inline skating",
      "martial arts",
      "racquet sports",
      "tennis",
      "badminton",
      "squash",
      "running",
      "track",
      "cross country",
      "running sports",
      "football",
      "soccer",
      "gridiron",
      "rugby",
      "snow  skiing",
      "water  skiing",
      "surfing",
      "swimming",
      "walking",
      "race walking"
    ]
  }
}